package dimensions

import (
//    "sync"
    "math/big"
)

type Dimension struct {
    dimension_type string
    default_type   string

    Value_source string
    Value        string
    Value_type   string
    Value_rat    *big.Rat
}

type SearchType struct {
    Search string
    Result string
    Description_ru string
    Ratio  int64
}

var WeightTypes = []SearchType{
    {"к", "KG", "Килограммы", -1000},
    {"k", "KG", "Килограммы", -1000},

    {"г", "GR", "Граммы",     1},
    {"g", "GR", "Граммы",     1},
}

var WidthTypes = []SearchType{
    {"км", "KM", "Километры",   -1000},
    {"km", "KM", "Километры",   -1000},

    {"дм", "DM", "Дециметры",   10},
    {"dm", "DM", "Дециметры",   10},

    {"см", "CM", "Сантиметры",  100},
    {"cm", "CM", "Сантиметры",  100},

    {"мм", "MM", "Миллиметры",  1000},
    {"mm", "MM", "Миллиметры",  1000},

    {"мкм", "µm", "Микрометры", 1000000},
    {"µm",  "µm", "Микрометры", 1000000},

    {"нм", "NM", "Нанометры",   1000000000},
    {"nm", "NM", "Нанометры",   1000000000},

    {"пм", "PM", "Пикометры",   1000000000000},
    {"pm", "PM", "Пикометры",   1000000000000},

    {"фм", "FM", "Фемтометры",  1000000000000000},
    {"fm", "FM", "Фемтометры",  1000000000000000},

    {"ам", "AM", "Аттометры",   1000000000000000000},
    {"am", "AM", "Аттометры",   1000000000000000000},

    {"к", "KM", "Километры",    -1000},
    {"k", "KM", "Километры",    -1000},

    {"м",  "M",  "Метры",       1},
    {"m",  "M",  "Метры",       1},

}

